taboadaa/ShuQi/nRF/Packages/.cache/Holtek.HT32_DFP.1.0.5.pdsc
      <!-- *************************  Device 'HT32F52220'  ***************************** -->
      <device Dname="HT32F52220">
        <compile header="ARM/INC/Holtek/HT32F520xx/ht32f520xx_01.h"/>
        <debug      svd="SVD/HT32F52220_30.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x800"      init   ="0"   default="1"/>
        <algorithm  name="ARM/Flash/HT32F.FLM"      start="0x00000000"  size="0x4000"                   default="1"/>
        <algorithm  name="ARM/Flash/HT32F_OPT.FLM"  start="0x1FF00000"  size="0x0400"                   default="0"/>
        <book    name="Documents/HT32F520xx/HT32F52220-30_UserManualv100.pdf"    title="HT32F52220/30 UserManual"/>
        <book    name="Documents/HT32F520xx/HT32F52220-30_Datasheetv110.pdf"     title="HT32F52220/30 Datasheet"/>
        <feature type="Timer"       n="1"     m="32"          name="BFTM"/>
        <feature type="Timer"       n="2"     m="16"          name="SCTM with single PWM"/>
        <feature type="Timer"       n="1"     m="16"          name="GPTM with Quadrature Decoder"/>
        <feature type="I2C"         n="1"/>
        <feature type="SPI"         n="1"/>
        <feature type="UART"        n="1"/>
        <feature type="ADC"         n="8"  m="12"/>
        <feature type="SOP"         n="24"                    name="SSOP24"/>
        <feature type="SOP"         n="28"                    name="SSOP48"/>
        <feature type="QFN"         n="33"                    name="QFN33"/>
        <feature type="IOs"         n="23"/>
      </device>

      <!-- *************************  Device 'HT32F52230'  ***************************** -->
      <device Dname="HT32F52230">
        <compile header="ARM/INC/Holtek/HT32F520xx/ht32f520xx_01.h"/>
        <debug      svd="SVD/HT32F52220_30.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x7C00"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
        <algorithm  name="ARM/Flash/HT32F.FLM"      start="0x00000000"  size="0x8000"                   default="1"/>
        <algorithm  name="ARM/Flash/HT32F_OPT.FLM"  start="0x1FF00000"  size="0x0400"                   default="0"/>
        <book    name="Documents/HT32F520xx/HT32F52220-30_UserManualv100.pdf"    title="HT32F52220/30 UserManual"/>
        <book    name="Documents/HT32F520xx/HT32F52220-30_Datasheetv110.pdf"     title="HT32F52220/30 Datasheet"/>
        <feature type="Timer"       n="1"     m="32"          name="BFTM"/>
        <feature type="Timer"       n="2"     m="16"          name="SCTM with single PWM"/>
        <feature type="Timer"       n="1"     m="16"          name="GPTM with Quadrature Decoder"/>
        <feature type="I2C"         n="1"/>
        <feature type="SPI"         n="1"/>
        <feature type="UART"        n="1"/>
        <feature type="ADC"         n="8"  m="12"/>
        <feature type="SOP"         n="24"                    name="SSOP24"/>
        <feature type="SOP"         n="28"                    name="SSOP28"/>
        <feature type="QFN"         n="33"                    name="QFN33"/>
        <feature type="IOs"         n="23"/>
      </device>

      <!-- *************************  Device 'HT32F52231'  ***************************** -->
      <device Dname="HT32F52231">
        <compile header="ARM/INC/Holtek/HT32F520xx/ht32f520xx_01.h"/>
        <debug      svd="SVD/HT32F52231_41.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
        <algorithm  name="ARM/Flash/HT32F.FLM"      start="0x00000000"  size="0x8000"                   default="1"/>
        <algorithm  name="ARM/Flash/HT32F_OPT.FLM"  start="0x1FF00000"  size="0x0400"                   default="0"/>
        <book    name="Documents/HT32F520xx/HT32F52231-41_HT32F52331-41_UserManualv120.pdf"    title="HT32F52231/41 UserManual"/>
        <book    name="Documents/HT32F520xx/HT32F52231-41_HT32F52331-41_Datasheetv140.pdf"     title="HT32F52231/41 Datasheet"/>
        <feature type="Timer"       n="2"     m="32"          name="BFTM"/>
        <feature type="Timer"       n="4"     m="16"          name="SCTM with single PWM"/>
        <feature type="Timer"       n="1"     m="16"          name="GPTM with Quadrature Decoder"/>
        <feature type="Timer"       n="1"     m="16"          name="MCTM with Complementary Outputs"/>
        <feature type="I2C"         n="2"/>
        <feature type="SPI"         n="2"/>
        <feature type="UART"        n="2"/>
        <feature type="ADC"         n="12"  m="12"/>
        <feature type="Other"       n="1"                     name="CRC"/>
        <feature type="SOP"         n="24"                    name="SSOP24"/>
        <feature type="SOP"         n="28"                    name="SSOP28"/>
        <feature type="QFN"         n="33"                    name="QFN33"/>
        <feature type="QFP"         n="48"                    name="LQFP48"/>
        <feature type="IOs"         n="40"/>
      </device>

      <!-- *************************  Device 'HT32F52241'  ***************************** -->
      <device Dname="HT32F52241">
        <compile header="ARM/INC/Holtek/HT32F520xx/ht32f520xx_01.h"/>
        <debug      svd="SVD/HT32F52231_41.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0xFC00"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"      init   ="0"   default="1"/>
        <algorithm  name="ARM/Flash/HT32F.FLM"      start="0x00000000"  size="0x10000"                   default="1"/>
        <algorithm  name="ARM/Flash/HT32F_OPT.FLM"  start="0x1FF00000"  size="0x0400"                   default="0"/>
        <book    name="Documents/HT32F520xx/HT32F52231-41_HT32F52331-41_UserManualv120.pdf"    title="HT32F52231/41 UserManual"/>
        <book    name="Documents/HT32F520xx/HT32F52231-41_HT32F52331-41_Datasheetv140.pdf"     title="HT32F52231/41 Datasheet"/>
        <feature type="Timer"       n="2"     m="32"          name="BFTM"/>
        <feature type="Timer"       n="4"     m="16"          name="SCTM with single PWM"/>
        <feature type="Timer"       n="1"     m="16"          name="GPTM with Quadrature Decoder"/>
        <feature type="Timer"       n="1"     m="16"          name="MCTM with Complementary Outputs"/>
        <feature type="I2C"         n="2"/>
        <feature type="SPI"         n="2"/>
        <feature type="UART"        n="2"/>
        <feature type="ADC"         n="12"  m="12"/>
        <feature type="Other"       n="1"                     name="CRC"/>
        <feature type="SOP"         n="24"                    name="SSOP24"/>
        <feature type="SOP"         n="28"                    name="SSOP28"/>
        <feature type="QFN"         n="33"                    name="QFN33"/>
        <feature type="QFP"         n="48"                    name="LQFP48"/>
        <feature type="IOs"         n="40"/>
      </device>
    </family>

  <!-- ************************  Series 'HT32F523xx'  **************************** -->
    <family Dfamily="HT32F523xx Series" Dvendor="Holtek:106">
      <processor Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
      <description>
      Holtek HT32F523xx series
      - ARM Cortex-M0+ running at 48 MHz
      - From 32 to 128 Kbytes embedded Flash
      - From 4 to 16 Kbytes embedded SRAM
      - Up to 51 I/O lines
      Peripherals
      - Timer: RTC, 2 BFTM, 4 SCTM, 2 GPTM, 1 MCTM
      - Communication: USB, I2S, 2 SCI, 2 SPI, 2 UART, 2 USART, 2 I2C
      - Extend Bus Interface(EBI)
      - Cyclic Redundancy Check(CRC-16/32)
      - ADC: 12-bit ADC up to 12 channels
      Packages
      - 33-pin QFN
      - 48/64-pin LQFP
      </description>

      <feature type="XTAL"        n="4000000" m="16000000"/>
      <feature type="IntRC"       n="8000000"/>
      <feature type="RTC"         n="32768"/>
      <feature type="VCC"         n="2.00"    m="3.60"/>
      <feature type="Temp"        n="-40"     m="85"/>
      <feature type="PowerMode"   n="5"                     name="Run,Sleep,Deep-Sleep1,Deep-Sleep2,Power-Down"/>
      <feature type="ExtInt"      n="16"/>
      <feature type="WDT"         n="1"/>
      <feature type="Timer"       n="2"     m="32"          name="BFTM"/>
      <feature type="Timer"       n="1"     m="16"          name="MCTM with Complementary Outputs"/>
      <feature type="I2C"         n="2"/>
      <feature type="SPI"         n="2"/>
      <feature type="UART"        n="2"/>
      <feature type="USBD"        n="1"/>
      <feature type="ADC"         n="12"  m="12"/>
      <feature type="Other"       n="1"                     name="CRC"/>

