taboadaa/ShuQi/nRF/Packages/.cache/Holtek.HT32_DFP.1.0.5.pdsc
      <!-- *************************  Device 'HT32F52331'  ***************************** -->
      <device Dname="HT32F52331">
        <compile header="ARM/INC/Holtek/HT32F520xx/ht32f520xx_01.h"/>
        <debug      svd="SVD/HT32F52331_41.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
        <algorithm  name="ARM/Flash/HT32F.FLM"      start="0x00000000"  size="0x8000"                   default="1"/>
        <algorithm  name="ARM/Flash/HT32F_OPT.FLM"  start="0x1FF00000"  size="0x0200"                   default="0"/>
        <book    name="Documents/HT32F520xx/HT32F52231-41_HT32F52331-41_UserManualv120.pdf"    title="HT32F52331/41 UserManual"/>
        <book    name="Documents/HT32F520xx/HT32F52231-41_HT32F52331-41_Datasheetv140.pdf"     title="HT32F52331/41 Datasheet"/>
        <feature type="Timer"       n="4"     m="16"          name="SCTM with single PWM"/>
        <feature type="Timer"       n="1"     m="16"          name="GPTM with Quadrature Decoder"/>
        <feature type="USART"       n="1"/>
        <feature type="ComOther"    n="1"                     name="SCI"/>
        <feature type="QFN"         n="33"                    name="QFN33"/>
        <feature type="QFP"         n="48"                    name="LQFP48"/>
        <feature type="IOs"         n="38"/>
      </device>

      <!-- *************************  Device 'HT32F52341'  ***************************** -->
      <device Dname="HT32F52341">
        <compile header="ARM/INC/Holtek/HT32F520xx/ht32f520xx_01.h"/>
        <debug      svd="SVD/HT32F52331_41.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0xFE00"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="ARM/Flash/HT32F.FLM"      start="0x00000000"  size="0x10000"                  default="1"/>
        <algorithm  name="ARM/Flash/HT32F_OPT.FLM"  start="0x1FF00000"  size="0x0200"                   default="0"/>
        <book    name="Documents/HT32F520xx/HT32F52231-41_HT32F52331-41_UserManualv120.pdf"    title="HT32F52331/41 UserManual"/>
        <book    name="Documents/HT32F520xx/HT32F52231-41_HT32F52331-41_Datasheetv140.pdf"     title="HT32F52331/41 Datasheet"/>
        <feature type="Timer"       n="4"     m="16"          name="SCTM with single PWM"/>
        <feature type="Timer"       n="1"     m="16"          name="GPTM with Quadrature Decoder"/>
        <feature type="USART"       n="1"/>
        <feature type="ComOther"    n="1"                     name="SCI"/>
        <feature type="QFN"         n="33"                    name="QFN33"/>
        <feature type="QFP"         n="48"                    name="LQFP48"/>
        <feature type="IOs"         n="38"/>
      </device>

      <!-- *************************  Device 'HT32F52342'  ***************************** -->
      <device Dname="HT32F52342">
        <compile header="ARM/INC/Holtek/HT32F520xx/ht32f520xx_01.h"/>
        <debug      svd="SVD/HT32F52342_52.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="ARM/Flash/HT32F.FLM"      start="0x00000000"  size="0x10000"                  default="1"/>
        <algorithm  name="ARM/Flash/HT32F_OPT.FLM"  start="0x1FF00000"  size="0x0200"                   default="0"/>
        <book    name="Documents/HT32F520xx/HT32F52342-52_UserManualv120.pdf"             title="HT32F52342/52 UserManual"/>
        <book    name="Documents/HT32F520xx/HT32F52342-52_Datasheetv110.pdf"              title="HT32F52342/52 Datasheet"/>
        <feature type="Timer"       n="2"     m="16"          name="SCTM with single PWM"/>
        <feature type="Timer"       n="2"     m="16"          name="GPTM with Quadrature Decoder"/>
        <feature type="USART"       n="2"/>
        <feature type="ComOther"    n="2"                     name="SCI"/>
        <feature type="DMA"         n="6"                     name="High-Speed DMA"/>
        <feature type="ExtBus"      n="16"                    name="EBI"/>
        <feature type="I2S"         n="1"/>
        <feature type="AnalogOther" n="2"                     name="Comparator"/>
        <feature type="QFP"         n="48"                    name="LQFP48"/>
        <feature type="QFP"         n="64"                    name="LQFP64"/>
        <feature type="IOs"         n="51"/>
      </device>

      <!-- *************************  Device 'HT32F52352'  ***************************** -->
      <device Dname="HT32F52352">
        <compile header="ARM/INC/Holtek/HT32F520xx/ht32f520xx_01.h"/>
        <debug      svd="SVD/HT32F52342_52.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x1fe00"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="ARM/Flash/HT32F.FLM"      start="0x00000000"  size="0x20000"                  default="1"/>
        <algorithm  name="ARM/Flash/HT32F_OPT.FLM"  start="0x1FF00000"  size="0x0200"                   default="0"/>
        <book    name="Documents/HT32F520xx/HT32F52342-52_UserManualv120.pdf"             title="HT32F52342/52 UserManual"/>
        <book    name="Documents/HT32F520xx/HT32F52342-52_Datasheetv110.pdf"              title="HT32F52342/52 Datasheet"/>
        <feature type="Timer"       n="2"     m="16"          name="SCTM with single PWM"/>
        <feature type="Timer"       n="2"     m="16"          name="GPTM with Quadrature Decoder"/>
        <feature type="USART"       n="2"/>
        <feature type="ComOther"    n="2"                     name="SCI"/>
        <feature type="DMA"         n="6"                     name="High-Speed DMA"/>
        <feature type="ExtBus"      n="16"                    name="EBI"/>
        <feature type="I2S"         n="1"/>
        <feature type="AnalogOther" n="2"                     name="Comparator"/>
        <feature type="QFP"         n="48"                    name="LQFP48"/>
        <feature type="QFP"         n="64"                    name="LQFP64"/>
        <feature type="IOs"         n="51"/>
      </device>
    </family>

  <!-- ************************  Series 'HT32F1236x'  **************************** -->
    <family Dfamily="HT32F1236x Series" Dvendor="Holtek:106">
      <processor Dcore="Cortex-M3" DcoreVersion="r2p0" Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
      <description>
      Holtek HT32F1236x series
      - ARM Cortex-M3 running at 96 MHz
      - 255 Kbytes embedded Flash
      - 64/128 Kbytes embedded SRAM
      - Up to 80 I/O lines
      Peripherals
      - Timer: RTC, 2 BFTM, 2 GPTM, 2 MCTM
      - Communication: USB, I2S, 2 SCI, 2 SPI, 2 USART, 2 UART, 2 I2C, SDIO
      - Extend Bus Interface(EBI)
      - Cyclic Redundancy Check(CRC-16/32)
      - ADC: 12-bit ADC up to 16 channels
      Packages
      - 48/64/100-pin LQFP
      </description>

      <feature type="XTAL"          n="4000000" m="16000000"/>
      <feature type="IntRC"         n="8000000"/>
      <feature type="RTC"           n="32768"/>
      <feature type="VCC"           n="2.00"    m="3.60"/>
      <feature type="Temp"          n="-40"     m="85"/>
      <feature type="PowerMode"     n="5"                   name="Run,Sleep,Deep-Sleep1,Deep-Sleep2,Power-Down"/>
      <feature type="ExtInt"        n="16"/>
      <feature type="WDT"           n="1"/>
      <feature type="DMA"           n="12"                  name="High-Speed DMA"/>
      <feature type="Timer"         n="2"       m="16"      name="GPTM with Quadrature Decoder"/>
      <feature type="Timer"         n="2"       m="16"      name="MCTM with Complementary Outputs"/>
      <feature type="Timer"         n="2"       m="32"      name="BFTM"/>
      <feature type="I2C"           n="2"/>
      <feature type="I2S"           n="1"/>
      <feature type="SPI"           n="2"/>
      <feature type="UART"          n="2"/>
      <feature type="USART"         n="2"/>
      <feature type="USBD"          n="1"/>
      <feature type="ComOther"      n="2"                   name="SCI"/>
      <feature type="ExtBus"        n="16"                  name="EBI"/>
      <feature type="Other"         n="1"                   name="CRC"/>
      <feature type="ADC"           n="16"      m="12"/>
      <feature type="AnalogOther"   n="2"                   name="Comparator"/>
      <feature type="IOs"           n="80"/>
      <feature type="QFP"           n="100"                 name="LQFP100"/>
      <feature type="QFP"           n="64"                  name="LQFP64"/>
      <feature type="QFP"           n="48"                  name="LQFP48"/>

      <!--<book    name="Documents/HT32F12365_66/HT32F12365-12366-22366_UserManualv100.pdf"            title="HT32F12365/12366/22366 UserManual"/>-->
      <book    name="Documents/HT32F12365_66/HT32F12365-12366-22366_Datasheetv110_Draft_20160422.pdf"             title="HT32F12365/12366/22366 Datasheet"/>

