taboadaa/ShuQi/nRF/Packages/.cache/Holtek.HT32_DFP.1.0.5.pdsc
      <!-- *************************  Device 'HT32F12365'  ***************************** -->
      <device Dname="HT32F12365">
        <compile    header="ARM/INC/Holtek/HT32F12365_66/ht32f12365_66.h"/>
        <debug      svd="SVD/HT32F12365_66.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x3FC00"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
        <algorithm  name="ARM/Flash/HT32F.FLM"      start="0x00000000"  size="0x3FC00"                  default="1"/>
        <algorithm  name="ARM/Flash/HT32F_OPT.FLM"  start="0x1FF00000"  size="0x0400"                   default="0"/>
      </device>

      <!-- *************************  Device 'HT32F12366'  ***************************** -->
      <device Dname="HT32F12366">
        <compile    header="ARM/INC/Holtek/HT32F12365_66/ht32f12365_66.h"/>
        <debug      svd="SVD/HT32F12365_66.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x3FC00"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="ARM/Flash/HT32F.FLM"      start="0x00000000"  size="0x3FC00"                  default="1"/>
        <algorithm  name="ARM/Flash/HT32F_OPT.FLM"  start="0x1FF00000"  size="0x0400"                   default="0"/>
      </device>

    </family>


  <!-- ************************  Series 'HT32F22366'  **************************** -->
    <family Dfamily="HT32F22366 Series" Dvendor="Holtek:106">
      <processor Dcore="Cortex-M3" DcoreVersion="r2p0" Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="96000000"/>
      <description>
      Holtek HT32 22366 ASSP MCU
      - ARM Cortex-M3 running at 96 MHz
      - 255 Kbytes embedded Flash
      - 128  Kbytes embedded SRAM
      - Up to 80 I/O lines
      Peripherals
      - CMOS Sensor Interface(CSIF)
      - Timer: RTC, 2 BFTM, 2 GPTM, 2 MCTM
      - Communication: USB, I2S, 2 SCI, 2 SPI, 2 USART, 2 UART, 2 I2C, SDIO
      - Extend Bus Interface(EBI)
      - Cyclic Redundancy Check(CRC-16/32)
      - ADC: 12-bit ADC up to 16 channels
      Packages
      - 48/64/100-pin LQFP
      </description>

      <feature type="XTAL"          n="4000000" m="16000000"/>
      <feature type="IntRC"         n="8000000"/>
      <feature type="RTC"           n="32768"/>
      <feature type="VCC"           n="2.00"    m="3.60"/>
      <feature type="Temp"          n="-40"     m="85"/>
      <feature type="PowerMode"     n="5"                   name="Run,Sleep,Deep-Sleep1,Deep-Sleep2,Power-Down"/>
      <feature type="ExtInt"        n="16"/>
      <feature type="WDT"           n="1"/>
      <feature type="DMA"           n="12"                  name="High-Speed DMA"/>
      <feature type="Timer"         n="2"       m="16"      name="GPTM with Quadrature Decoder"/>
      <feature type="Timer"         n="2"       m="16"      name="MCTM with Complementary Outputs"/>
      <feature type="Timer"         n="2"       m="32"      name="BFTM"/>
      <feature type="I2C"           n="2"/>
      <feature type="I2S"           n="1"/>
      <feature type="SPI"           n="2"/>
      <feature type="UART"          n="2"/>
      <feature type="USART"         n="2"/>
      <feature type="USBD"          n="1"/>
      <feature type="ComOther"      n="2"                   name="SCI"/>
      <feature type="ExtBus"        n="16"                  name="EBI"/>
      <feature type="Other"         n="1"                   name="CRC"/>
      <feature type="ComOther"      n="1"                   name="CSIF"/>
      <feature type="ADC"           n="16"      m="12"/>
      <feature type="AnalogOther"   n="2"                   name="Comparator"/>
      <feature type="IOs"           n="80"/>
      <feature type="QFP"           n="100"                 name="LQFP100"/>
      <feature type="QFP"           n="64"                  name="LQFP64"/>
      <feature type="QFP"           n="48"                  name="LQFP48"/>


      <!--<book    name="Documents/HT32F12365_66/HT32F12365-12366-22366_UserManualv100.pdf"            title="HT32F12365/12366/22366 UserManual"/>-->
      <book    name="Documents/HT32F12365_66/HT32F12365-12366-22366_Datasheetv110_Draft_20160422.pdf"             title="HT32F12365/12366/22366 Datasheet"/>

      <!-- *************************  Device 'HT32F22366'  ***************************** -->
      <device Dname="HT32F22366">
        <compile    header="ARM/INC/Holtek/HT32F12365_66/ht32f12365_66.h"/>
        <debug      svd="SVD/HT32F12365_66.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x3FC00"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
        <algorithm  name="ARM/Flash/HT32F.FLM"      start="0x00000000"  size="0x3FC00"                  default="1"/>
        <algorithm  name="ARM/Flash/HT32F_OPT.FLM"  start="0x1FF00000"  size="0x0400"                   default="0"/>
      </device>
    </family>

  </devices>

  <conditions>
    <condition id="Compiler ARM">                                             <!-- conditions selecting ARM Compiler -->
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="HT32Fxxxx CMSIS Device">                                   <!-- conditions selecting Devices -->
      <description>Holtek HT32F1xxx device series, CMSIS-CORE, and ARMCC compiler</description>
      <require Cclass ="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Holtek:106" Dname="HT32F[1256]*"/>
    </condition>

    <condition id="HT32F125x">
      <description>Holtek Cortex-M3 Standard MCU Low Density Device</description>
      <accept Dname="HT32F125[123]*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F175x">
      <description>Holtek Cortex-M3 Standard MCU Mid Density Device</description>
      <accept Dname="HT32F17[56]5"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F1653_54">
      <description>Holtek Cortex-M3 Standard MCU Mid Density Device</description>
      <accept Dname="HT32F165[34]"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F1655_56">
      <description>Holtek Cortex-M3 Standard MCU High Density Device</description>
      <accept Dname="HT32F165[56]"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F2755">
      <description>Holtek Cortex-M3 ASSP Device</description>
      <accept Dname="HT32F2755"/>
      <require condition="Compiler ARM"/>
    </condition>

